Revit 2027 API
AnalysisDisplayLegendSettings Constructor
 Constructs a default instance of legend settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayLegendSettings()
Public Sub New
public:
AnalysisDisplayLegendSettings()
new : unit -> AnalysisDisplayLegendSettings
See Also
Reference
AnalysisDisplayLegendSettings Class
AnalysisDisplayLegendSettings Overload
Autodesk.Revit.DB.Analysis Namespace